Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: Python provides two general-purpose iterator objects. The first, a sequence iterator, works with an arbitrary sequence supporting the :meth:`__getitem__` method. The second works with a callable object and a sentinel value, calling the callable for each item in the sequence, and ending the iteration when the sentinel value is returned.
pl: Język pytonowski dostarcza dwa ogólnego użytku przedmioty iterujące. Pierwszy przedmiot iterujący po sekwencji, współpracuje z dowolną sekwencją wspierającą sposób działania :meth:`__getitem__`. Drugi współpracuje z przedmiotami reagującymi na wywołanie i flagą-bezpiecznikiem, wywołując przedmiot reagujący na wywołanie dla każdego elementu sekwencji, i kończąc iteracje po otrzymaniu powrotnej flagi-bezpiecznika.

source: List Objects
pl: Przedmioty list

source: Integer Objects
pl: Przedmioty liczb całkowitych

source: All integers are implemented as "long" integer objects of arbitrary size.
pl: Wszystkie liczby całkowite są realizowane jako przedmioty liczb całkowitych "długich" o określonym rozmiarze.

source: Mapping Protocol
pl: Protokół mapowania

source: Data marshalling support
pl: Wsparcie dla marszruty danych.

source: These routines allow C code to work with serialized objects using the same data format as the :mod:`marshal` module. There are functions to write data into the serialization format, and additional functions that can be used to read the data back. Files used to store marshalled data must be opened in binary mode.
pl: Te utarte sposoby postępowania pozwalają kodowi C działać z przedmiotami serializowanymi przy użyciu tych samych formatów danych jak moduł :mod:`marshal`a. Istnieją zadania do wpisywania danych do formatów serializowalnych, i dodatkowe zadania, które mogą być używane do odczytania danych otrzymanych tą drogą. Pliki używane do przechowywania marszrutowanych danych muszą być otwarte w trybie binarnym.

source: Numeric values are stored with the least significant byte first.
pl: Wartości numeryczne zapisywane są z najmniej znaczącym bajtem jako pierwszym.

source: The module supports two versions of the data format: version 0 is the historical version, version 1 shares interned strings in the file, and upon unmarshalling. Version 2 uses a binary format for floating point numbers. *Py_MARSHAL_VERSION* indicates the current file format (currently 2).
pl: Moduł wspiera dwie wersje formatu danych: wersja 0 jest wersją historyczną, wersja 1 zachowuje w pliku pobrane ciągi znaków z momentu odmarszrutowania. Wersja 2 używa formatu binarnego dla liczb zmiennoprzecinkowych: *Py_MARSHAL_VERSION* wskazuje aktualny format pliku (obecnie 2).

source: The following functions allow marshalled values to be read back in.
pl: Następujące zadania pozwalają marszrutowanym wartościom na wczytywanie ich na powrót.

source: XXX What about error detection? It appears that reading past the end of the file will always result in a negative numeric value (where that's relevant), but it's not clear that negative values won't be handled properly when there's no error. What's the right way to tell? Should only non-negative values be written using these routines?
pl: XXX Co ze sprawdzaniem błędów? Wygląda na to, że wczytywanie po końcu pliku zawsze spowoduje wczytanie ujemnej wartości liczbowej (tam gdzie jest to istotne), ale nie jest jasne czy ujemne wartości nie będą potraktowane właściwie gdy nie będą one skutkiem błędu. Jak właściwe rozeznać? Czy tylko nieujemne wartości powinny być zapisywane używając tych sposobów postępowania?

source: Memory Management
pl: Zarządzanie Pamięcią

source: Overview
pl: Skorowidz

source: Memory management in Python involves a private heap containing all Python objects and data structures. The management of this private heap is ensured internally by the *Python memory manager*. The Python memory manager has different components which deal with various dynamic storage management aspects, like sharing, segmentation, preallocation or caching.
pl: Zarządzanie pamięcią w języku pytonowskim zakłada prywatną stertę zawierającą wszystkie przedmioty języka pytonowskiego i struktury danych. Zarządzanie tą prywatną stertą jest zapewniane wewnętrznie przez *zarządcę pamięci języka pytonowskiego*. Zarządca pamięci języka pytonowskiego ma różne komponenty które radzą sobie z różnymi aspektami dynamicznego przechowywania, jak współdzielenie, segmentacja, alokacja wstępna i kieszeniowanie.

source: At the lowest level, a raw memory allocator ensures that there is enough room in the private heap for storing all Python-related data by interacting with the memory manager of the operating system. On top of the raw memory allocator, several object-specific allocators operate on the same heap and implement distinct memory management policies adapted to the peculiarities of every object type. For example, integer objects are managed differently within the heap than strings, tuples or dictionaries because integers imply different storage requirements and speed/space tradeoffs. The Python memory manager thus delegates some of the work to the object-specific allocators, but ensures that the latter operate within the bounds of the private heap.
pl: Na najniższym poziomie, przedmiot przydzielający pamięć "na-surowo" zapewnia że będzie dość pamięci na prywatnej stercie dla przechowania wszystkich związanych-z-językiem-pytonowskim danych przez współdziałanie z zarządcą pamięci systemu operacyjnego. Ponad zarządcą surowej pamięci, kilka szczególnych dla danych typów przedmiotów zarządców operuje na tej samej stercie i wypełnia szczególne zasady zarządzania pamięcią dostosowane do szczególnych własności każdego rodzaju przedmiotu. Dla przykładu przedmioty liczb całkowitych są zarządzane inaczej wewnątrz sterty niż ciągi znaków, krotki czy słowniki gdyż liczby całkowite zakładają inne wymagania przechowywania i wady i zalety prędkości/zajętej przestrzeni. Zarządca pamięcią języka pytonowskiego zatem odprawia pewną ilość nakładów pracy dla szczególnych dla przedmiotów różnych typów zarządców, ale zapewnia że te drugie będą operować wewnątrz ograniczeń prywatnej sterty.

source: It is important to understand that the management of the Python heap is performed by the interpreter itself and that the user has no control over it, even if she regularly manipulates object pointers to memory blocks inside that heap. The allocation of heap space for Python objects and other internal buffers is performed on demand by the Python memory manager through the Python/C API functions listed in this document.
pl: Istotnym jest pojąć że zarządzanie stertą języka pytonowskiego jest dokonywane przez program interpretujący polecenia języka pytonowskiego sam w sobie i że użytkownik nie ma nad nim żadnej kontroli, nawet jeśli regularnie zmienia wskaźniki przedmiotowe do obszarów pamięci wewnątrz sterty. Przydział przestrzeni pamięci dla przedmiotów języka pytonowskiego i innych wewnętrznych obszarów wymiany jest dokonywany na żądanie przez zarządcę pamięci języka pytonowskiego za pośrednictwem zadań sprzęgu między językami pytonowskim i C opisanych w tym dokumencie.

source: To avoid memory corruption, extension writers should never try to operate on Python objects with the functions exported by the C library: :cfunc:`malloc`, :cfunc:`calloc`, :cfunc:`realloc` and :cfunc:`free`. This will result in mixed calls between the C allocator and the Python memory manager with fatal consequences, because they implement different algorithms and operate on different heaps. However, one may safely allocate and release memory blocks with the C library allocator for individual purposes, as shown in the following example::
pl: Aby uniknąć zburzenia porządku pamięci, piszący rozszerzenia nie powinni nigdy próbować operować na przedmiotach języka pytonowskiego za pomocą zadań udostępnionych z biblioteki C: :cfunc:`malloc`, :cfunc:`calloc`, :cfunc:`realloc` i :cfunc:`free`. To doprowadzi do pomieszania wywołań pomiędzy zarządcą z języka C i zarządcą z języka pytonowskiego z fatalnymi konsekwencjami, ponieważ realizują one różne algorytmy i operują na różnych stertach. Jednakże można bezpiecznie przydzielać i zwalniać obszary pamięci dla indywidualnych potrzeb, jak pokazano w następującym przykładzie::

source: PyObject *res; char *buf = (char *) malloc(BUFSIZ); /* for I/O */ if (buf == NULL) return PyErr_NoMemory(); ...Do some I/O operation involving buf... res = PyString_FromString(buf); free(buf); /* malloc'ed */ return res;
pl: PyObject *zasob; char *buf = (char *) malloc(BUFSIZ); /* dla we/wy */ if (buf == NULL) return PyErr_NoMemory(); ...Wykonaj pewne operacje we/wy korzystające z buf... zasob = PyString_FromString(buf); free(buf); /* malloc-nięte */ return res;

source: In this example, the memory request for the I/O buffer is handled by the C library allocator. The Python memory manager is involved only in the allocation of the string object returned as a result.
pl: W tym przykładzie, żądanie do pamięci obszaru wymiany jest obsługiwane przez zarządcę bibliotecznego języka C. Zarządca pamięci języka pytonowskiego zajmuje się tylko przydziałem miejsca dla przedmiotu ciągu znaków zwracanego jako wynik.

source: In most situations, however, it is recommended to allocate memory from the Python heap specifically because the latter is under control of the Python memory manager. For example, this is required when the interpreter is extended with new object types written in C. Another reason for using the Python heap is the desire to *inform* the Python memory manager about the memory needs of the extension module. Even when the requested memory is used exclusively for internal, highly-specific purposes, delegating all memory requests to the Python memory manager causes the interpreter to have a more accurate image of its memory footprint as a whole. Consequently, under certain circumstances, the Python memory manager may or may not trigger appropriate actions, like garbage collection, memory compaction or other preventive procedures. Note that by using the C library allocator as shown in the previous example, the allocated memory for the I/O buffer escapes completely the Python memory manager.
pl: W większości przypadków, jednakże, zalecane jest umieszczanie w pamięci ze sterty języka pytonowskiego szczególnie ponieważ ta ostatnia jest pod kontrolą zarządcy pamięci języka Pytonowskiego. Na przykład, jest to wymagane gdy program interpretujący polecenia języka pytonowskiego jest rozszerzany nowymi typami przedmiotów napisanych w języku C. Inną przyczyną użycia sterty języka pytonowskiego jest chęć *poinformowania* zarządcy pamięci języka pytonowskiego o potrzebach pamięciowych modułu rozszerzającego. Nawet gdy żądana pamięć jest używana wyłącznie dla wewnętrznych wysoko-wyspecjalizowanych potrzeb, oddelegowanie wszystkich zapytań o pamięć do zarządcy pamięci języka pytonowskiego spowoduje że program interpretujący polecenia języka pytonowskiego będzie miał bardziej trafny obraz podstawowego rozmiaru potrzeb pamięciowych jako całości. Konsekwentnie, w pewnych warunkach zarządca pamięci języka pytonowskiego może lub może nie uruchomić właściwych działań, jak zbiórki śmieci, porządkowania pamięci lub innych zapobiegawczych działań. Zauważ, że używając programu bibliotecznego lokującego pamięć z języka C jak pokazano w poprzednim przykładzie zarezerwowana pamięć dla obszaru wymiany wejścia/wyjścia całkowicie umyka uwadze zarządcy pamięci języka pytonowskiego.

source: Memory Interface
pl: Sprzęg Pamięci

source: The following function sets, modeled after the ANSI C standard, but specifying behavior when requesting zero bytes, are available for allocating and releasing memory from the Python heap:
pl: Następujące zbiory zadań, ukształtowane na wzór standardu znanego z ANSI C, ale określając zachowanie po zażądaniu zera kęsów, są dostępne do lokowania i zwalniania pamięci na stercie języka pytonowskiego:

source: The following type-oriented macros are provided for convenience. Note that *TYPE* refers to any C type.
pl: Następujące makropolecenia zorientowane-według-typu dostarczone są dla wygody. Zauważ że *TYP* odnosi się do dowolnego typu C.

source: In addition, the following macro sets are provided for calling the Python memory allocator directly, without involving the C API functions listed above. However, note that their use does not preserve binary compatibility across Python versions and is therefore deprecated in extension modules.
pl: Dodać należy, że następujący zbiór makropoleceń dostarczony jest aby odwoływać się do programu przydzielającego pamięć w języku pytonowskim bezpośrednio, bez udziału zadań sprzęgu C wymienionych powyżej. Jednakże, zauważ, że ich użycie nie zachowuje wzajemnej zgodności binarnej pomiędzy wersjami języka pytonowskiego i z tego też powodu ich użycie jest niewskazane w modułach rozszerzających.

source: Examples
pl: Przykłady

source: Here is the example from section :ref:`memoryoverview`, rewritten so that the I/O buffer is allocated from the Python heap by using the first function set::
pl: Tutaj jest przykład z sekcji "przeglądu pamięci" - z ang. - :ref:`memoryoverview`, przepisane, tak aby przestrzeń wejścia/wyjścia była przydzielona ze sterty języka pytonowskiego używając pierwszego zestawu zadań::

source: PyObject *res; char *buf = (char *) PyMem_Malloc(BUFSIZ); /* for I/O */ if (buf == NULL) return PyErr_NoMemory(); /* ...Do some I/O operation involving buf... */ res = PyString_FromString(buf); PyMem_Free(buf); /* allocated with PyMem_Malloc */ return res;
pl: PyObject *zasob; char *buf = (char *) PyMem_Malloc(BUFSIZ); /* dla we/wy */ if (buf == NULL) return PyErr_NoMemory(); /* ...Wykonaj pewne operacje we/wy dotyczące buf... */ zasob = PyString_FromString(buf); PyMem_Free(buf); /* umieszczone przez PyMem_Malloc */ return zasob;

source: The same code using the type-oriented function set::
pl: ten sam kod przy użyciu zorientowanych na typ zbiorów zadań::

source: PyObject *res; char *buf = PyMem_New(char, BUFSIZ); /* for I/O */ if (buf == NULL) return PyErr_NoMemory(); /* ...Do some I/O operation involving buf... */ res = PyString_FromString(buf); PyMem_Del(buf); /* allocated with PyMem_New */ return res;
pl: PyObject *zasob; char *buf = PyMem_New(char, BUFSIZ); /* dla we/wy */ if (buf == NULL) return PyErr_NoMemory(); /* ...Wykonaj pewne operacje we/wy dotyczące buf... */ zasob = PyString_FromString(buf); PyMem_Del(buf); /* utworzone przez PyMem_New */ return zasob;

source: Note that in the two examples above, the buffer is always manipulated via functions belonging to the same set. Indeed, it is required to use the same memory API family for a given memory block, so that the risk of mixing different allocators is reduced to a minimum. The following code sequence contains two errors, one of which is labeled as *fatal* because it mixes two different allocators operating on different heaps. ::
pl: Zauważ, że w dwóch powyższych przykładach, przestrzeń wymiany jest zawsze zmieniana przez zadania należące do tego samego zbioru. Właściwie, jest wymagane użycie tej samej rodziny sprzęgów zarządzania pamięcią (z ang. - memory API) dla danego obszaru pamięci, tak, że ryzyko pomieszania różnych programów lokujących zmniejszone jest do minimum. Następująca sekwencja zawiera dwa błędy, jeden z których określony jest jako *krytyczny* ponieważ miesza dwa różne programy lokujące pamięć działające na różnych stertach. ::

source: char *buf1 = PyMem_New(char, BUFSIZ); char *buf2 = (char *) malloc(BUFSIZ); char *buf3 = (char *) PyMem_Malloc(BUFSIZ); ... PyMem_Del(buf3); /* Wrong -- should be PyMem_Free() */ free(buf2); /* Right -- allocated via malloc() */ free(buf1); /* Fatal -- should be PyMem_Del() */
pl: char *buf1 = PyMem_New(char, BUFSIZ); char *buf2 = (char *) malloc(BUFSIZ); char *buf3 = (char *) PyMem_Malloc(BUFSIZ); ... PyMem_Del(buf3); /* Źle -- powinno być PyMem_Free() */ free(buf2); /* Prawidłowo -- przydzielone przez malloc() */ free(buf1); /* Krytyczny błąd -- powinno być PyMem_Del() */

source: In addition to the functions aimed at handling raw memory blocks from the Python heap, objects in Python are allocated and released with :cfunc:`PyObject_New`, :cfunc:`PyObject_NewVar` and :cfunc:`PyObject_Del`.
pl: Na dodatek do zadań określonych dla obsługi surowych obszarów pamięci ze sterty języka pytonowskiego, przedmioty w języku pytonowskim są umieszczane i pamięć po nich jest zwalniana przy użyciu :cfunc:`PyObject_New`, :cfunc:`PyObject_NewVar` i :cfunc:`PyObject_Del`.

source: These will be explained in the next chapter on defining and implementing new object types in C.
pl: Te zostaną wyjaśnione w następnym rozdziale o określaniu i realizowaniu nowych typów przedmiotów w języku C.

source: Instance Method Objects
pl: Przedmioty Sposobów postępowania dla egzemplarzy.

source: An instance method is a wrapper for a :cdata:`PyCFunction` and the new way to bind a :cdata:`PyCFunction` to a class object. It replaces the former call ``PyMethod_New(func, NULL, class)``.
pl: Sposób postępowania dla egzemplarza jest opakowaniem dla :cdata:`PyCFunction` i nowym sposobem na związanie :cdata:`PyCFunction` do przedmiotu klasy. Zastępuje poprzednie wezwanie ``PyMethod_New(func, NULL, class)``.

source: Method Objects
pl: Przedmioty Sposobów Postępowania

source: Methods are bound function objects. Methods are always bound to an instance of an user-defined class. Unbound methods (methods bound to a class object) are no longer available.
pl: Sposoby Postępowania są związanymi przedmiotami zadań. Sposoby postępowania są zawsze związane z przykładowymi przedmiotami należącymi do zdefiniowanych przez użytkownika kategorii. Niezwiązane sposoby postępowania (sposoby postępowania związane z przedmiotem kategorii) nie są już dostępne.

source: Module Objects
pl: Przedmioty modułów

source: There are only a few functions special to module objects.
pl: Istnieje tylko kilka zadań szczególnych dla przedmiotów modułów.

source: Initializing C modules
pl: Inicjowanie modułów języka C.

source: These functions are usually used in the module initialization function.
pl: Te zadania są zwykle używane w zadaniu rozpoczynającym modułu

source: The None Object
pl: Przedmiot "Żaden" - z ang. - None

source: Note that the :ctype:`PyTypeObject` for ``None`` is not directly exposed in the Python/C API. Since ``None`` is a singleton, testing for object identity (using ``==`` in C) is sufficient. There is no :cfunc:`PyNone_Check` function for the same reason.
pl: Zauważ, że :ctype:`PyTypeObject` dla ``Żadnego`` - z ang. - ``None`` nie jest bezpośrednio wystawiany w sprzęgu między językami pytonowskim a C. Ponieważ ``Żaden`` - z ang. - ``None`` jest kategorią samą w sobie, sprawdzanie tożsamości przedmiotu (używając ``==`` w języku C) jest wystarczające. Nie istnieje zadanie :cfunc:`PyNone_Check` z tego samego powodu.

source: Number Protocol
pl: Protokół Liczbowy

source: Buffer Protocol
pl: Protokół Wymiany Danych

source: Object Protocol
pl: Protokół Przedmiotów

source: Subclass determination is done in a fairly straightforward way, but includes a wrinkle that implementors of extensions to the class system may want to be aware of. If :class:`A` and :class:`B` are class objects, :class:`B` is a subclass of :class:`A` if it inherits from :class:`A` either directly or indirectly. If either is not a class object, a more general mechanism is used to determine the class relationship of the two objects. When testing if *B* is a subclass of *A*, if *A* is *B*, :cfunc:`PyObject_IsSubclass` returns true. If *A* and *B* are different objects, *B*'s :attr:`__bases__` attribute is searched in a depth-first fashion for *A* --- the presence of the :attr:`__bases__` attribute is considered sufficient for this determination.
pl: sprawdzanie podkategorii jest dokonywane w raczej prosto zrozumiały sposób, ale zawiera załomek o którym realizatorzy rozszerzeń systemu kategorii mogliby chcieć wiedzieć. Jeśli kategoria przedmiotów :class:`A` i kategoria przedmiotów :class:`B` są przedmiotami kategorii przedmiotów, wtedy kategoria przedmiotów :class:`B` jest podkategorią przedmiotów kategorii przedmiotów :class:`A`, jeśli dziedziczy po kategorii przedmiotów :class:`A` bezpośrednio lub pośrednio. Jeśli któraś z nich nie jest przedmiotem kategorii przedmiotów, wtedy bardziej ogólny mechanizm jest używany do sprawdzenia relację bycia podkategorią zachodzącą pomiędzy dwoma przedmiotami. Sprawdzając czy *B* jest podkategorią *A*, jeśli *A* jest *B*, wtedy zadanie :cfunc:`PyObject_IsSubclass` zwraca prawdę. Jeśli *A* i *B* są różnymi przedmiotami, wtedy atrybut *B* - :attr:`__bases__` jest przeszukiwany w sposób "wpierw-wgłąb" na obecność *A* --- obecność atrybutu :attr:`__bases__` jest uważana za wystarczającą dla tego sprawdzenia.

source: Object Implementation Support
pl: Wsparcie dla realizacji przedmiotów

source: This chapter describes the functions, types, and macros used when defining new object types.
pl: Ten rozdział opisuje zadania, rodzaje przedmiotów, i makrodefinicje i makropolecenia używane przy definiowaniu nowych rodzajów przedmiotów.

source: Reference Counting
pl: Zliczanie Odniesień

source: The macros in this section are used for managing reference counts of Python objects.
pl: Makropolecenia w tym rozdziale są używane do zarządzania liczbami odniesień dla przedmiotów w języku pytonowskim.

source: The following functions are for runtime dynamic embedding of Python: ``Py_IncRef(PyObject *o)``, ``Py_DecRef(PyObject *o)``. They are simply exported function versions of :cfunc:`Py_XINCREF` and :cfunc:`Py_XDECREF`, respectively.
pl: Następujące zadania służą dynamicznemu załączaniu kodów języka pytonowskiego: ``Py_IncRef(PyObject *o)``, ``Py_DecRef(PyObject *o)``. Są one po prostu uzewnętrznionymi wersjami zadań :cfunc:`Py_XINCREF` i :cfunc:`Py_XDECREF`, odpowiednio.

source: The following functions or macros are only for use within the interpreter core: :cfunc:`_Py_Dealloc`, :cfunc:`_Py_ForgetReference`, :cfunc:`_Py_NewReference`, as well as the global variable :cdata:`_Py_RefTotal`.
pl: Następujące zadania lub makropolecenia są tylko do użytku wewnątrz rdzenia programu iterpretującego polecenia języka pytonowskiego: :cfunc:`_Py_Dealloc`, :cfunc:`_Py_Forget_Reference` :cfunc:`_Py_NewReference`, zarówno, jak też nadrzędną zmienną :cdata:`_Py_RefTotal`.

source: Reflection
pl: Refleksja

source: Sequence Protocol
pl: Protokół Sekwencji

source: Set Objects
pl: Przedmioty Zbiorów
